# BRepBuilderPersistentIds Properties

---
The BRepBuilderPersistentIds type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
BRepBuilderPersistentIds Class
Autodesk.Revit.DB Namespace